import requests

API_KEY = '99cc8b4e06d75f01d4e794f4aa5addb1'
url = f"http://api.currencylayer.com/live?access_key={API_KEY}"

response = requests.get(url)
data = response.json()

currency_names = {
    "AED": "Дирхам ОАЭ",
    "AFN": "Афгани",
    "ALL": "Албанский лек",
    "AMD": "Армянский драм",
    "ANG": "Нидерландский антильский гульден",
    "AOA": "Ангольская кванза",
    "ARS": "Аргентинское песо",
    "AUD": "Австралийский доллар",
    "AWG": "Арубанский флорин",
    "AZN": "Азербайджанский манат",
    "BAM": "Боснийская конвертируемая марка",
    "BBD": "Барбадосский доллар",
    "BDT": "Бангладешская така",
    "BGN": "Болгарский лев",
    "BHD": "Бахрейнский динар",
    "BIF": "Бурундийский франк",
    "BMD": "Бермудский доллар",
    "BND": "Брунейский доллар",
    "BOB": "Боливийский боливиано",
    "BRL": "Бразильский реал",
    "BSD": "Багамский доллар",
    "BTC": "Биткойн",
    "BTN": "Бутанский нгултрум",
    "BWP": "Ботсванская пула",
    "BYN": "Белорусский рубль",
    "BYR": "Белорусский рубль (старый)",
    "BZD": "Белизский доллар",
    "CAD": "Канадский доллар",
    "CDF": "Конголезский франк",
    "CHF": "Швейцарский франк",
    "CLF": "Условная денежная единица Чили",
    "CLP": "Чилийское песо",
    "CNY": "Китайский юань",
    "CNH": "Китайский юань (офшорный)",
    "COP": "Колумбийское песо",
    "CRC": "Коста-риканский колон",
    "CUC": "Кубинское конвертируемое песо",
    "CUP": "Кубинское песо",
    "CVE": "Кабо-Верде эскудо",
    "CZK": "Чешская крона",
    "DJF": "Франк Джибути",
    "DKK": "Датская крона",
    "DOP": "Доминиканское песо",
    "DZD": "Алжирский динар",
    "EGP": "Египетский фунт",
    "ERN": "Накфа Эритреи",
    "ETB": "Эфиопский быр",
    "EUR": "Евро",
    "FJD": "Фиджийский доллар",
    "FKP": "Фунт Фолклендских островов",
    "GBP": "Фунт стерлингов Соединенного королевства",
    "GEL": "Грузинский лари",
    "GGP": "Гернсийский фунт",
    "GHS": "Ганский седи",
    "GIP": "Гибралтарский фунт",
    "GMD": "Гамбийский даласи",
    "GNF": "Гвинейский франк",
    "GTQ": "Гватемальский кетсаль",
    "GYD": "Гайанский доллар",
    "HKD": "Гонконгский доллар",
    "HNL": "Гондурасская лемпира",
    "HRK": "Хорватская куна",
    "HTG": "Гаитянский гурд",
    "HUF": "Венгерский форинт",
    "IDR": "Индонезийская рупия",
    "ILS": "Израильский шекель",
    "IMP": "Фунт Острова Мэн",
    "INR": "Индийская рупия",
    "IQD": "Иракский динар",
    "IRR": "Иранский риал",
    "ISK": "Исландская крона",
    "JEP": "Джерсийский фунт",
    "JMD": "Ямайский доллар",
    "JOD": "Иорданский динар",
    "JPY": "Японская иена",
    "KES": "Кенийский шиллинг",
    "KGS": "Киргизский сом",
    "KHR": "Камбоджийский риель",
    "KMF": "Франк Коморских островов",
    "KPW": "Северокорейская вона",
    "KRW": "Южнокорейская вона",
    "KWD": "Кувейтский динар",
    "KYD": "Доллар Каймановых островов",
    "KZT": "Казахстанский тенге",
    "LAK": "Лаосский кип",
    "LBP": "Ливанский фунт",
    "LKR": "Шри-ланкийская рупия",
    "LRD": "Либерийский доллар",
    "LSL": "Лоти Лесото",
    "LTL": "Литовский лит",
    "LVL": "Латвийский лат",
    "LYD": "Ливийский динар",
    "MAD": "Марокканский дирхам",
    "MDL": "Молдавский лей",
    "MGA": "Малагасийский ариари",
    "MKD": "Македонский денар",
    "MMK": "Мьянманский кьят",
    "MNT": "Монгольский тугрик",
    "MOP": "Патака Макао",
    "MRU": "Мавританская угия",
    "MUR": "Маврикийская рупия",
    "MVR": "Мальдивская руфия",
    "MWK": "Малавийская квача",
    "MXN": "Мексиканское песо",
    "MYR": "Малайзийский ринггит",
    "MZN": "Мозамбикский метикал",
    "NAD": "Намибийский доллар",
    "NGN": "Нигерийская найра",
    "NIO": "Никарагуанская кордоба",
    "NOK": "Норвежская крона",
    "NPR": "Непальская рупия",
    "NZD": "Новозеландский доллар",
    "OMR": "Оманский риал",
    "PAB": "Панамский бальбоа",
    "PEN": "Перуанский соль",
    "PGK": "Кина Папуа - Новая Гвинея",
    "PHP": "Филиппинское песо",
    "PKR": "Пакистанская рупия",
    "PLN": "Польский злотый",
    "PYG": "Парагвайский гуарани",
    "QAR": "Катарский риал",
    "RON": "Румынский лей",
    "RSD": "Сербский динар",
    "RUB": "Российский рубль",
    "RWF": "Руандийский франк",
    "SAR": "Саудовский риал",
    "SBD": "Доллар Соломоновых островов",
    "SCR": "Сейшельская рупия",
    "SDG": "Суданский фунт",
    "SEK": "Шведская крона",
    "SGD": "Сингапурский доллар",
    "SHP": "Фунт Святой Елены",
    "SLE": "Леоне (Сьерра-Леоне)",
    "SLL": "Сьерра-леонский леоне",
    "SOS": "Сомалийский шиллинг",
    "SRD": "Суринамский доллар",
    "STD": "Добра Сан-Томе и Принсипи",
    "SVC": "Сальвадорский колон",
    "SYP": "Сирийский фунт",
    "SZL": "Лилангени Свазиленда",
    "THB": "Таиландский бат",
    "TJS": "Таджикский сомони",
    "TMT": "Туркменский манат",
    "TND": "Тунисский динар",
    "TOP": "Паанга Тонга",
    "TRY": "Турецкая лира",
    "TTD": "Тринидадский доллар",
    "TWD": "Тайваньский доллар",
    "TZS": "Танзанийский шиллинг",
    "UAH": "Украинская гривна",
    "UGX": "Угандийский шиллинг",
    "UYU": "Уругвайское песо",
    "UZS": "Узбекский сум",
    "VEF": "Венесуэльский боливар (старый)",
    "VES": "Венесуэльский боливар",
    "VND": "Вьетнамский донг",
    "VUV": "Вату Вануату",
    "WST": "Самоанская тала",
    "XAF": "Центральноафриканский франк",
    "XAG": "Серебро",
    "XAU": "Золото",
    "XCD": "Восточно-карибский доллар",
    "XDR": "Специальные права заимствования",
    "XOF": "Западноафриканский франк",
    "XPF": "Французский тихоокеанский франк",
    "YER": "Йеменский риал",
    "ZAR": "Южноафриканский рэнд",
    "ZMK": "Замбийская квача (старый)",
    "ZMW": "Замбийская квача",
    "ZWL": "Зимбабвийский доллар"
}


def sort_by_rate_api(rates, reverse=False):
    return format_exchange_rates(sorted(rates, key=lambda x: x[0], reverse=reverse))

def sort_by_currency_code_api(rates, reverse=False):
    return format_exchange_rates(sorted(rates, key=lambda x: x[1], reverse=reverse))

def sort_by_currency_name_api(rates, reverse=False):
    return format_exchange_rates(sorted(rates, key=lambda x: currency_names.get(x[1], x[1]), reverse=reverse))

def format_exchange_rates(sorted_rates: list) -> str:
    result = "За 100 российских рублей вы сможете купить:\n"
    for i in sorted_rates:
        rate = i[0]
        currency_code = i[1]
        currency_name = i[2]
        amount = 100 * rate
        result += f"{amount:.2f} {currency_code} - {currency_name}\n"
    return result

def main():
    if data['success']:
        quotes = data['quotes']

        formatted_rates = []

        for currency_pair, rate in quotes.items():
            target_currency = currency_pair[3:]
            rub_in_usd = 100 / quotes.get('USDRUB', None)
            currency_name = currency_names.get(target_currency, target_currency)

            formatted_rates.append((rate * rub_in_usd, target_currency, currency_name))

        return formatted_rates

    else:
        print(f"Error: {data['error']['info']}")
        return []